Revit 2027 API
IFCImportOptions Methods
The IFCImportOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetConversionData |  Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists.
GetExtraOptions |  Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExtraOptions |  Set the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value. Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace